beauty-of-programming/2-number.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>第2章 数字之魅</title>
<!-- 2014-11-19 三 10:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="马楠（nxmanan#gmail.com）" />
<meta  name="description" content="编程之美笔记"
 />
<meta  name="keywords" content="Algorithm" />
<link rel="stylesheet" type="text/css" href="./style/emacs.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="http://manan.org"> HOME </a>
</div><div id="content">
<h1 class="title">第2章 数字之魅</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">2.1 求二进制数中的位数</a></li>
<li><a href="#sec-2">2.2 不要被阶乘吓到</a></li>
<li><a href="#sec-3">2.3 寻找发贴水王</a></li>
<li><a href="#sec-4">2.5 寻找最大的K个数</a></li>
<li><a href="#sec-5">2.7 最大公约数</a></li>
<li><a href="#sec-6">2.9 Fibonacci数列</a></li>
<li><a href="#sec-7">2.10 寻找数组中的最大值和最小值</a></li>
<li><a href="#sec-8">2.12 快速找到满足条件的两个数</a></li>
<li><a href="#sec-9">2.13 子数组的最大乘积</a></li>
<li><a href="#sec-10">2.14 求数组的子数组之和的最大值</a></li>
<li><a href="#sec-11">2.15 字数组之和的最大值（二维）</a></li>
<li><a href="#sec-12">2.16 求数组中最长递增自序列</a></li>
<li><a href="#sec-13">2.17 数组循环移位</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2.1 求二进制数中的位数</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>求模或位操作
</li>
<li>v &amp;= (v - 1)，每次消掉最低位的1
<ul class="org-ul">
<li>同样可以用来计算一个数是否为2的方幂
</li>
</ul>
</li>
<li>查表：预先计算出结果存在数组中，直接查
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2.2 不要被阶乘吓到</h2>
<div class="outline-text-2" id="text-2">
<p>
问题：
</p>
<ol class="org-ol">
<li>阶乘N!的末尾有多少个0？
<ul class="org-ul">
<li>求因子5的个数
</li>
</ul>
</li>
<li>阶乘N!的二进制中最低位1的位置？
<ul class="org-ul">
<li>求因子2的个数
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">2.3 寻找发贴水王</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>如果已排序：中间的ID是数量超过一半的ID
</li>
<li>遍历一遍，更新当前记录的ID和次数
</li>
</ol>

<p>
计算机科学的普遍思想：将一个问题转化为规模较小的若干个问题，如分治，递推，贪心。在转化过程中，小的问题跟原文题基本一致。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">2.5 寻找最大的K个数</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>部分排序 <b>？？？</b>
</li>
<li>快速排序思想：划分
</li>
<li>找第K大的数，然后得到比它大的数
</li>
<li>最小堆（假如K比较大，放不进内存）
</li>
<li>计数排序思想：记录每个整数出现的次数，取最大的K个
</li>
</ol>
<p>
1-3反复练习。
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">2.7 最大公约数</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>辗转相除法
<ul class="org-ul">
<li>大整数取模开销大
</li>
</ul>
</li>
<li>取模换为减法
<ul class="org-ul">
<li>迭代次数多
</li>
</ul>
</li>
<li>根据奇偶性，进行除以2的操作，用位操作
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">2.9 Fibonacci数列</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>递归
</li>
<li>存储已经计算的结果
</li>
<li>用矩阵算出递推公式，快速求出矩阵的幂
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">2.10 寻找数组中的最大值和最小值</h2>
<div class="outline-text-2" id="text-7">
<p>
1.5N：遍历一遍，同时找
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">2.12 快速找到满足条件的两个数</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>先排序，然后找——O(nlogn);
</li>
<li>使用hash存储所有数字，实现快速查找——时间O(n)，空间O(n);
</li>
<li>先排序，然后头和尾相加，逐渐向中间靠拢——O(nlogn)。
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">2.13 子数组的最大乘积</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>空间换时间:遍历数组,求出前i个元素和后i个元素的乘积并记录,然后直接求值；
</li>
<li>根据数组中的正负号和0的个数,份情况讨论。
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">2.14 求数组的子数组之和的最大值</h2>
<div class="outline-text-2" id="text-10">
<p>
先考虑各种可能输入，确定题意。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">暴力法，枚举</td>
<td class="left">O(N<sup>2</sup>)</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">分治法，从中间分开，分成三种情况比较，递归</td>
<td class="left">O(N*log<sub>2</sub>N)</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">动态规划，从尾向头计算</td>
<td class="left">O(N)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">2.15 字数组之和的最大值（二维）</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>用部分和优化矩阵求和的过程——用已经计算出来的结果计算新结果。
</li>
<li>枚举上下边，用一维情况计算左右边
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">2.16 求数组中最长递增自序列</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>动态规划：根据前面子数组计算后面结果
</li>
<li>TODO
</li>
</ol>
</div>
</div>



<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">2.17 数组循环移位</h2>
<div class="outline-text-2" id="text-13">
<p>
逆序操作
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014-11-15</p>
<p class="author">Author: 马楠（nxmanan#gmail.com）</p>
<p class="date">Created: 2014-11-19 三 10:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7b)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
